# kvadratychisel

Выведите на экран все точные квадраты натуральных чисел, не превосходящие данного числа N. Выводить квадраты следует от меньшего к большему.

Входные данные:
Одно целое число N. (
1
≤
N
≤
10000
1≤N≤10000)

Выходные данные: 
Квадраты натуральных чисел, записанные через пробел.


#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main(void) {
int n,x = 1, i = 1; 

scanf("%d",&n); 

while(x<=n)
  { 
    x=i*i; 
    i+=1;
    if (x > n) break;
    printf("%d ",x); 
 } 

 return 0;
  }
